IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM18_CONTROLSS_G2_EPWM18.xml
	<register id="CONTROLSS_G2_EPWM18_TZSEL2" acronym="CONTROLSS_G2_EPWM18_TZSEL2" offset="0x102" width="16" description="Trip Zone Select Register 2">
		<bitfield id="CAPEVTOST" width="1" begin="8" end="8" resetval="0x0" description="CAPEVT OST Select   0: Disable CAPEVT as a one-shot trip source for this ePWM module  1: Enable CAPEVT as a one-shot trip source for this ePWM module" range="8" rwaccess="R/W"/> 
		<bitfield id="CAPEVTCBC" width="1" begin="0" end="0" resetval="0x0" description="CAPEVT  CBC mode Select   0: Disable CAPEVT as a CBC trip source for this ePWM module  1: Enable CAPEVT as a CBC trip source for this ePWM module" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM18_TZDCSEL" acronym="CONTROLSS_G2_EPWM18_TZDCSEL" offset="0x104" width="16" description="Trip Zone Digital Comparator Select Register">
		<bitfield id="DCBEVT2" width="3" begin="11" end="9" resetval="0x0" description="Digital Compare Output B Event 2 Selection   000: Event disabled  001: DCBH = low, DCBL = don't care  010: DCBH = high, DCBL = don't care  011: DCBL = low, DCBH = don't care  100: DCBL = high, DCBH = don't care  101: DCBL = high, DCBH = low  110: Reserved  111: Reserved" range="11 - 9" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1" width="3" begin="8" end="6" resetval="0x0" description="Digital Compare Output B Event 1 Selection   000: Event disabled  001: DCBH = low, DCBL = don't care  010: DCBH = high, DCBL = don't care  011: DCBL = low, DCBH = don't care  100: DCBL = high, DCBH = don't care  101: DCBL = high, DCBH = low  110: Reserved  111: Reserved" range="8 - 6" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="3" begin="5" end="3" resetval="0x0" description="Digital Compare Output A Event 2 Selection   000: Event disabled  001: DCAH = low, DCAL = don't care  010: DCAH = high, DCAL = don't care  011: DCAL = low, DCAH = don't care  100: DCAL = high, DCAH = don't care  101: DCAL = high, DCAH = low  110: Reserved  111: Reserved" range="5 - 3" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="3" begin="2" end="0" resetval="0x0" description="Digital Compare Output A Event 1 Selection   000: Event disabled  001: DCAH = low, DCAL = don't care  010: DCAH = high, DCAL = don't care  011: DCAL = low, DCAH = don't care  100: DCAL = high, DCAH = don't care  101: DCAL = high, DCAH = low  110: Reserved  111: Reserved" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM18_TZCTL" acronym="CONTROLSS_G2_EPWM18_TZCTL" offset="0x108" width="16" description="Trip Zone Control Register">
		<bitfield id="DCBEVT2" width="2" begin="11" end="10" resetval="0x0" description="Digital Compare Output B Event 2 Action On EPWMxB   00: High-impedance [EPWMxB = High-impedance state]  01: Force EPWMxB to a high state.  10: Force EPWMxB to a low state.  11: Do Nothing, trip action is disabled" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1" width="2" begin="9" end="8" resetval="0x0" description="Digital Compare Output B Event 1 Action On EPWMxB   00: High-impedance [EPWMxB = High-impedance state]  01: Force EPWMxB to a high state.  10: Force EPWMxB to a low state.  11: Do Nothing, trip action is disabled" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="2" begin="7" end="6" resetval="0x0" description="Digital Compare Output A Event 2 Action On EPWMxA   00: High-impedance [EPWMxA = High-impedance state]  01: Force EPWMxA to a high state.  10: Force EPWMxA to a low state.  11: Do Nothing, trip action is disabled" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="2" begin="5" end="4" resetval="0x0" description="Digital Compare Output A Event 1 Action On EPWMxA   00: High-impedance [EPWMxA = High-impedance state]  01: Force EPWMxA to a high state.  10: Force EPWMxA to a low state.  11: Do Nothing, trip action is disabled" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="TZB" width="2" begin="3" end="2" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2Trip Action On EPWMxB  When a trip event occurs the following action is taken on output EPWMxB. Which trip-zone pins can cause an event is defined in the TZSEL register.   00: High-impedance [EPWMxB = High-impedance state]  01: Force EPWMxB to a high state  10: Force EPWMxB to a low state  11: Do nothing, no action is taken on EPWMxB." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="TZA" width="2" begin="1" end="0" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2 Trip Action On EPWMxA  When a trip event occurs the following action is taken on output EPWMxA. Which trip-zone pins can cause an event is defined in the TZSEL register.   00: High-impedance [EPWMxA = High-impedance state]  01: Force EPWMxA to a high state  10: Force EPWMxA to a low state  11: Do nothing, no action is taken on EPWMxA." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM18_TZCTL2" acronym="CONTROLSS_G2_EPWM18_TZCTL2" offset="0x10A" width="16" description="Additional Trip Zone Control Register">
		<bitfield id="ETZE" width="1" begin="15" end="15" resetval="0x0" description="TZCTL2 Enable   0: Use trip action from TZCTL [legacy EPWM compatibility]  1: Use trip action defined in TZCTL2, TZCTLDCA and TZCTLDCB. Settings in TZCTL are ignored" range="15" rwaccess="R/W"/> 
		<bitfield id="TZBD" width="3" begin="11" end="9" resetval="0x0" description="TZ1 to TZ6 Trip Action On EPWMxB while Count direction is DOWN   000: HiZ [EPWMxB = HiZ state]  001: Forced Hi [EPWMxB = High state]  010: Forced Lo [EPWMxB = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="11 - 9" rwaccess="R/W"/> 
		<bitfield id="TZBU" width="3" begin="8" end="6" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2 Trip Action On EPWMxB while Count direction is UP   000: HiZ [EPWMxB = HiZ state]  001: Forced Hi [EPWMxB = High state]  010: Forced Lo [EPWMxB = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="8 - 6" rwaccess="R/W"/> 
		<bitfield id="TZAD" width="3" begin="5" end="3" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2 Trip Action On EPWMxA while Count direction is DOWN   000: HiZ [EPWMxA = HiZ state]  001: Forced Hi [EPWMxA = High state]  010: Forced Lo [EPWMxA = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="5 - 3" rwaccess="R/W"/> 
		<bitfield id="TZAU" width="3" begin="2" end="0" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2 Trip Action On EPWMxA while Count direction is UP   000: HiZ [EPWMxA = HiZ state]  001: Forced Hi [EPWMxA = High state]  010: Forced Lo [EPWMxA = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="2 - 0" rwaccess="R/W"/>
	</register>
